Конфигурация/Documents/гкс_РегистрацияНаПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>гкс_РегистрацияНаПЛК</Name>
			<BasedOn>
				<xr:Item>Document.гкс_ВъездНаКПП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.гкс_СДИЗНаПЛК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПолучатель</Name>
					<Comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внутригрупповой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаВъезда</Name>
					<Comment>Точка маршрута для определения проезда</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ИДРейса</Name>
					<Comment>ERP-2176</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияВеса</Name>
					<Comment>Ед.измерения веса в документе</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗоныКарантинногоКонтроля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗоныКарантинногоКонтроляСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесоваяВъезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПроезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаОтгрузкуПродукции</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузкаСОдногоБорта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ВъездНаКПП</v8:Type>
						<v8:Type>cfg:DocumentRef.гкс_СРПВПрибытиеНаПуть</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СДИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СДИЗЗЕРНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/гкс_СРПВСтатусыОформленияВагонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>гкс_СРПВСтатусыОформленияВагонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_Взвешивание</v8:Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерВагона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_НомерВагона</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючАналитикиСРПВ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлючиАналитикиСРПВ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ДокументыСРПВ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СРПВСтатусыВагонов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/гкс_СРПВСтатусыВагонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_СРПВСтатусыВагонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенБрутто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзвешенТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/гкс_ТипРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_ТипРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/гкс_ТипыТранспортныхСредствДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_ТипыТранспортныхСредствДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Судно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самолёт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезДоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Трубопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/гкс_ВъездНаКПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>гкс_ВъездНаКПП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиоВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПроезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/гкс_РегистрацияНаПЛК/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ОчиститьРеквизитыПриКопировании();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если НЕ ЗначениеЗаполнено(МестнаяДата) И ЗначениеЗаполнено(ТочкаМаршрута) Тогда
			МестнаяДата = Справочники.гкс_ТочкиМаршрута.ПолучитьМестнуюДатуПоТочкеМаршрута(ТочкаМаршрута);
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			
			ТипОснования = ТипЗнч(ДанныеЗаполнения.ДокументОснование);
			
			Если ТипОснования = Тип("ДокументСсылка.гкс_ВъездНаКПП") Тогда
				
				ЗаполнитьДокументНаОснованииВъездаНаКПП(ДанныеЗаполнения.ДокументОснование);
				
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.гкс_СРПВПрибытиеНаПуть")
				И ДанныеЗаполнения.Свойство("ТранспортныйДокумент") Тогда	
					
				ЗаполнитьДокументНаОснованииПрибытияВагона(ДанныеЗаполнения);
					
			КонецЕсли;
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.гкс_ЗаявкаНаОтгрузкуПродукции") Тогда	
		
		ЗаполнитьДокументНаОснованииЗаявкиНаОтгрузкуПродукции(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ЗаполнитьЕдиницуИзмерения();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПредставлениеЗоныКарантинногоКонтроляСтрокой();
	ЗаполнитьЕдиницуИзмерения();

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ЗапретИзмененияДокументаПоРеестру(Отказ) Тогда		
       Возврат;
	КонецЕсли;
	
	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапретИзмененияДокументаПоРеестру(Отказ) Тогда		
       Возврат;
	КонецЕсли;
		
	гкс_ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Ошибки = Неопределено;
	
	Если Не ПроверитьТранспортныйДокумент(Ошибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		Возврат;
	КонецЕсли;	
			
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ); 
	
	Если гкс_УчетВагоновСРПВ.ИспользуетсяИнтеграцияСРПВ()
		И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.гкс_СРПВПрибытиеНаПуть") Тогда
		
		КлючАналитикиСРПВ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ИдентификаторОтправки");
		Статус = Перечисления.гкс_СРПВСтатусыВагонов.Прибыл;
		РегистрыСведений.гкс_СРПВСтатусыОформленияВагонов
			.ОтразитьСвязьСДокументомСРПВ(КлючАналитикиСРПВ, Статус, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		ПроверяемыеРеквизиты.Добавить("НомерДокументаПоставщика");
		ПроверяемыеРеквизиты.Добавить("УсловиеПроезда");
		Если ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль Тогда
			ПроверяемыеРеквизиты.Добавить("ВесНетто");
		КонецЕсли;	
	КонецЕсли;
	
	Если Внутригрупповой Тогда
		ПроверяемыеРеквизиты.Добавить("Собственник");
	КонецЕсли;

	ТекстОшибки = "";
	Если Не гкс_ПриемкаТранспорта
		.ПроверкаЗаполненияДляКонтроляПревышенияВесаАвтомобиля(ТранспортноеСредство, ТекстОшибки) Тогда	
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьДокументНаОснованииВъездаНаКПП(Знач ДокументОснование)
			
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВъездНаКПП.Номенклатура КАК Номенклатура,
	|	ВъездНаКПП.УсловиеПроезда КАК УсловиеПроезда,
	|	ВЫБОР
	|		КОГДА ВъездНаКПП.УсловиеПроезда = ЗНАЧЕНИЕ(Справочник.гкс_УсловияПроезда.FCA)
	|			ТОГДА ВъездНаКПП.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВъездНаКПП.УсловиеПроезда = ЗНАЧЕНИЕ(Справочник.гкс_УсловияПроезда.DAP)
	|			ТОГДА ВъездНаКПП.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК ОтправительПолучатель,
	|	ВъездНаКПП.НомерТранспортногоСредства КАК НомерТранспортногоСредства,
	|	ВъездНаКПП.ФиоВодителя КАК Водитель
	|ИЗ
	|	Документ.гкс_ВъездНаКПП КАК ВъездНаКПП
	|ГДЕ
	|	ВъездНаКПП.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);
	
		КоличествоСимволовНомераТранспорта = гкс_ПриемкаТранспорта.КоличествоСимволовДляПоискаПоНомеру();
	
		ТранспортноеСредство = Справочники.ТранспортныеСредства.
			ТранспортноеСредствоПоЧастиНомера(ВыборкаДетальныеЗаписи.НомерТранспортногоСредства, 
										  	  КоличествоСимволовНомераТранспорта);
		
	КонецЦикла;
					
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииЗаявкиНаОтгрузкуПродукции(Знач ДокументОснование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаявкаНаОтгрузкуПродукцииТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаОтгрузкуПродукции.Контрагент КАК Контрагент,
	|	ЗаявкаНаОтгрузкуПродукции.Водитель КАК Водитель,
	|	ЗаявкаНаОтгрузкуПродукции.Грузополучатель КАК Грузополучатель
	|ИЗ
	|	Документ.гкс_ЗаявкаНаОтгрузкуПродукции.Товары КАК ЗаявкаНаОтгрузкуПродукцииТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЗаявкаНаОтгрузкуПродукции КАК ЗаявкаНаОтгрузкуПродукции
	|		ПО ЗаявкаНаОтгрузкуПродукцииТовары.Ссылка = ЗаявкаНаОтгрузкуПродукции.Ссылка
	|ГДЕ
	|	ЗаявкаНаОтгрузкуПродукцииТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
		ОтправительПолучатель = ВыборкаДетальныеЗаписи.Грузополучатель;
		Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Водитель = ВыборкаДетальныеЗаписи.Водитель;
	КонецЦикла;
		
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииПрибытияВагона(ДанныеЗаполнения)
	 
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	РеквизитыТД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.ТранспортныйДокумент,
		"НомерДокумента, Номер, ДатаДокумента, Дата, ПунктПогрузки, Отправитель, Организация, Получатель");
	
	НомерДокументаПоставщика = ?(ЗначениеЗаполнено(РеквизитыТД.НомерДокумента),
		РеквизитыТД.НомерДокумента, РеквизитыТД.Номер);
		
	ДатаДокументаПоставщика = ?(ЗначениеЗаполнено(РеквизитыТД.ДатаДокумента), 
		РеквизитыТД.ДатаДокумента, РеквизитыТД.Дата);	
			
	Внутригрупповой = гкс_ПриемкаТранспорта.ЭтоВнутригрупповаяПеревозка(РеквизитыТД.Получатель);
	Если Внутригрупповой Тогда
		Организация = Справочники.Организации.ОрганизацияКонтрагента(РеквизитыТД.Получатель);
		Собственник = РеквизитыТД.Организация;
	Иначе
		Собственник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыТД.Организация, "КонтрагентОрганизации");
	КонецЕсли;
	
	Контрагент = РеквизитыТД.Отправитель;
	УсловиеПроезда = Справочники.гкс_УсловияПроезда.DAP;
	
	ПунктПогрузки = РеквизитыТД.ПунктПогрузки;
	КонтрагентВладелецСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПунктПогрузки, 
		"КонтрагентВладелецСклада");
	  
	Если ЗначениеЗаполнено(КонтрагентВладелецСклада) Тогда
		ОтправительПолучатель = КонтрагентВладелецСклада;
	Иначе
		ОтправительПолучатель = РеквизитыТД.Отправитель;
	КонецЕсли;
		
	ТранспортноеСредство = Справочники.ТранспортныеСредства
		.ТранспортноеСредствоПоНомеру(ДанныеЗаполнения.НомерВагона);	
		
	ЗаполнитьВесПоТранспортномуДокументу(ДанныеЗаполнения.ТранспортныйДокумент);	
							
КонецПроцедуры
		
Процедура ЗаполнитьЕдиницуИзмерения()
	
	Если НЕ ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) Тогда
		ЕдиницаИзмеренияВеса = гкс_ПриемкаТранспортаВызовСервера.ПолучитьЕдиницуИзмеренияВесаПриемки();			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ПроверитьТранспортныйДокумент(Ошибки)
	
	МенеджерОбъекта = гкс_ЛокализацияСервер.МодульЛокализации("гкс_РегистрацияНаПЛК");
	Если МенеджерОбъекта = Неопределено Тогда
		ЗаполненКорректно = ТранспортныйДокументЗаполненКорректно();
	Иначе
		ЗаполненКорректно = МенеджерОбъекта.ТранспортныйДокументЗаполненКорректно(ЭтотОбъект);		
	КонецЕсли;
			
	Если Не ЗаполненКорректно Тогда	
		ТекстСообщения = НСтр("ru = '%1: Не определен Транспортный документ!'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Ссылка);	
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстСообщения);		
	КонецЕсли;	
	
	Возврат ЗаполненКорректно;
	
КонецФункции

Функция ТранспортныйДокументЗаполненКорректно()
	
	ЗаполненКорректно = Истина;

	Если ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт
		И ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		
		Если ДополнительныеСвойства.Свойство("ТранспортныйДокумент") Тогда
			ЗаполненКорректно = ЗначениеЗаполнено(ДополнительныеСвойства.ТранспортныйДокумент);
		Иначе 		
			ИнформацияОТранспорте = гкс_ПриемкаТранспортаВызовСервера.ИнформацияОТранспортеПоРегистрации(Ссылка);
			
			Если Не (ЗначениеЗаполнено(ИнформацияОТранспорте) 
				И ЗначениеЗаполнено(ИнформацияОТранспорте.ТранспортныйДокумент)) Тогда	
				ЗаполненКорректно = Ложь;		
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗаполненКорректно;
	
КонецФункции	

Процедура ЗаполнитьПредставлениеЗоныКарантинногоКонтроляСтрокой()
	
	АдресЗоныКарантинногоКонтроляСтрокой = УправлениеКонтактнойИнформацией
	         .ПредставлениеКонтактнойИнформации(АдресЗоныКарантинногоКонтроля);
	         
КонецПроцедуры

Процедура ОчиститьРеквизитыПриКопировании()
	
	ПустаяДата = Дата(1, 1, 1);
	ПустойТранспорт = Справочники.ТранспортныеСредства.ПустаяСсылка();
	ПустойКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	RFIDEPC = "";
	RFIDTID = "";
		
	Дата = ТекущаяДатаСеанса;
	МестнаяДата = ТекущаяДатаСеанса;
	ДатаДокументаПоставщика = ПустаяДата;
	
	ДокументОснование = Неопределено;
	
	НомерДокументаПоставщика = "";
	Водитель = "";
	гкс_ИДРейса = "";
	Комментарий = "";
	
	ВесБрутто = 0;
	ВесНетто = 0;
	ВесТары = 0;
	
	Отклонен = Ложь;
	       	
	ТранспортноеСредство = ПустойТранспорт;
	ВесоваяВъезда = Справочники.гкс_СтруктураПЛК.ПустаяСсылка();
	
	Если ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка Тогда
		
		Контрагент = ПустойКонтрагент;
		ОтправительПолучатель = ПустойКонтрагент;
		
		Если ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль Тогда
		
			Прицеп = ПустойТранспорт;
				
		ИначеЕсли ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт Тогда	
			
			Спецификация = Документы.гкс_СпецификацияКДоговоруКонтрагента.ПустаяСсылка();
		КонецЕсли;	
	КонецЕсли;	
		
КонецПроцедуры

// Заполнить вес по транспортному документу и Транспортному средству регситрации.
// 
// Параметры:
//  ТранспортныйДокумент - ДокументСсылка.гкс_ТранспортныйДокумент
Процедура ЗаполнитьВесПоТранспортномуДокументу(ТранспортныйДокумент) Экспорт
	
	ПараметрыПолучения = 
		Новый Структура("ТранспортныйДокумент, ТранспортноеСредство", ТранспортныйДокумент, ТранспортноеСредство);
	ДанныеПоВесуТранспортногоДокумента = Документы.гкс_ТранспортныйДокумент.ПолучитьДанныеПоВесу(ПараметрыПолучения);
	
	ЗаполнитьЕдиницуИзмерения();
	гкс_ПриемкаТранспорта.ПересчитатьВесВЕдиницахДокумента(ДанныеПоВесуТранспортногоДокумента, ЕдиницаИзмеренияВеса);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеПоВесуТранспортногоДокумента, , "ЕдиницаИзмеренияВеса");
	
КонецПроцедуры

Функция ЗапретИзмененияДокументаПоРеестру(Отказ)
	
	Если гкс_ПриемкаТранспорта.ЗапретИзмененияДокументаПоРеестру(Ссылка) Тогда		
		Отказ = Истина;
		ИмяСобытия = НСтр("ru = 'Запрет изменения документа'");
		ТекстШаблона = НСтр("ru = 'Не удалось записать документ: %1 т.к. уже оформлен реестр ЗПП-3'");
				
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.гкс_РегистрацияНаПЛК, 
			Ссылка, СтрШаблон(ТекстШаблона, Ссылка));

		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
   
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
#КонецЕсли
